{
    "_id": "67346881f6c94c3b1c0cfaf4",
    "Course-ID": "noc24-hs151",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "Introduction to Basic Spoken Sanskrit and Intermediate Level of Spoken Sanskrit",
    "Course-instructor": "Prof. Anuradha Choudry",
    "Institute-name": "IIT Kharagpur",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs151/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109105135",
    "content": "ABOUT THE COURSE: The knowledge of Sanskrit is very helpful for anyone who is interested in delving into the original texts relating to various subjects from the Indian traditional knowledge systems. This language, however, is often presented as a difficult language to learn for many and moreover as a classical language of the past that is of no special relevance in the contemporary world. Those who have been exposed to it in school often regard it as nothing more than a scoring subject and have little appreciation for the various dimensions of the language. The objective of this course if to give students a taste of Sanskrit as a living language by introducing them to its basic grammatical structures so that they can start understanding simple texts as well as allow them to use it in daily life. It also seeks to give them an understanding and appreciation of the beauty of the different aspects of this language from its sounds to its rich content so that they feel enthused enough to delve further into it. INTENDED AUDIENCE: This is a language course and therefore it would be relevant for students from different disciplinary backgrounds of science, technology, computer sciences and humanities and social sciences. INDUSTRY SUPPORT: Not applicable Summary Course Status : Completed Course Type : Elective Duration : 12 weeks Category : Humanities and Social Sciences Credit Points : 3 Level : Undergraduate/Postgraduate Start Date : 24 Jul 2023 End Date : 13 Oct 2023 Enrollment Ends : 07 Aug 2023 Exam Registration Ends : 18 Aug 2023 Exam Date : 29 Oct 2023 IST Note: This exam date is subjected to change based on seat availability. You can check final exam date on your hall ticket. FacebookXTeamsLinkedInWhatsAppShare"
}