{
    "_id": "67346881f6c94c3b1c0cfbf9",
    "Course-ID": "noc24-ge66",
    "Discipline": "Multidisciplinary",
    "Course-name": "Accreditation and Outcome Based Learning",
    "Course-instructor": "Prof. Ak Ray (Retd.)\nProf. Sk Das Mandal",
    "Institute-name": "IIT Kharagpur",
    "Duration": "8 Weeks",
    "Start-date": "August 19, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ge66/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/127105017",
    "content": "Globalization, changing demographics and technological advancements are some of the key driving forces of the future. Our students will have to be prepared to face these challenges and seize the opportunities brought about by these forces. In Twenty-first Century Learning, students use educational technologies to apply knowledge to new situations, analyze information, collaborate, solve problems, and make decisions. Twenty-first century education structured should be outcome based which developed certain critical core competencies such as collaboration, digital literacy, critical thinking, and problem-solving, self learning. The curriculum should incorporates higher order thinking skills, multiple intelligences, technology and multimedia, communication skill and self learning methodology along with authenticated scientific assessments and evaluation. Curriculum should provide direction so that student can learn by themselves and work both independently and interdependently. The curriculum and instruction are designed to challenge all students, and provides for differentiation. So the curriculum is not a syllabus or textbook-driven or fragmented, it should be set of Specific, Measurable, Appropriate, Challenging but Achievable educational objective or Skills (outcome) which students will be acquire at the end. Evaluation of student achievement can be made more valid and reliable as the benchmark of achievements is explicitly stated.The course equips the learner with the tools and techniques for effective teaching and hand on practices through specially designed software with appropriate pedagogic framework for design outcome based curricula. Course outcome ?¢‚Ç¨¬¢ Identify and write down the outcome based course, module and unit objectives based on Bloom Taxonomy ?¢‚Ç¨¬¢ Develop appropriate test items for all outcome based objectives for both summative and formative evaluation. ?¢‚Ç¨¬¢ Plan an outcome-based curriculum document to meet NBA and Washington Accord requirements."
}