{
    "_id": "67346881f6c94c3b1c0cfb91",
    "Course-ID": "noc24-me123",
    "Discipline": "Mechanical Engineering",
    "Course-name": "Fundamentals of Manufacturing Processes",
    "Course-instructor": "Prof. D. K. Dwivedi",
    "Institute-name": "IIT Roorkee",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_me123/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/112107219",
    "content": "It is proposed to include fundamental of following aspects of manufacturing technology\nA) Understanding Manufacturing: concept of manufacturing, need, scope, advantages, limitation, application, materials and manufacturing, classification of manufacturing, process capabilities, selection, break even analysis of manufacturing processes\nB) Casting: approach, steps, pattern, molding, gate and riser, melt treatment, solidification, casting processes: sand mould, shell mould, permanent mould casting, casting defect and their remedy\nC) Forming: approach, hot and cold forming, rolling, forging, extrusion, drawing, sheet metal forming, press, dies, types of dies and die set sheet metal operations punching, blanking, notching, nibbling\nD) Joining: approach, need, principle of fusion welding, gas welding, thermit welding, arc welding  common arc welding processes, resistance welding, weldability of metals, solidification of weld, weld discontinuities and their remedy\nE) Machining: approach, mechanism, classification, cutting tool, tool material, heat generation, cutting fluid, grinding, internal and external surface grinding, centerless grinding designation and selection of grinding wheel, trueing and balancing, honing, reaming, lapping, polishing etc.\nF) Improving properties: heat treatment of steel and aluminum alloys, Fe-C diagram, TTT diagram, and CCT diagram, heat treatment processes annealing, normalizing, quenching tempering, surface modification methods namely without change chemistry, changing chemical composition and development of coating and cladding."
}