{
    "_id": "67346881f6c94c3b1c0cfafc",
    "Course-ID": "noc24-hs153",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "The English Novel: Interdisciplinary Approaches",
    "Course-instructor": "Prof. Aruni Mahapatra & Prof. Smita Jha",
    "Institute-name": "IIT Roorkee",
    "Duration": "8 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "September 13, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs153/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109107498",
    "content": "Some of the most powerful and widely studied novels and poems in the English language were composed in the 19th century. These texts are conventionally called “Victorian,” because the time period in which they were published and first read overlaps with Queen Victoria’s reign (1837—1901). Recently, however, “Victorian” as a descriptor of literary quality has become increasingly untenable. Many scholars have questioned the narrowly White and Anglo-centric bias of this nomenclature.\nThis course takes stock of new theoretical work from postcolonialism, ecocriticism, as well as feminist and disability studies theory to offer new ways of understanding and enjoying “Victorian” literature. Students will learn about the debates and conflicts from which these texts, as well as the academic term “Victorianism,” came to be. Students will use ideas from new theoretical paradigms to critically evaluate many “great” writers and their work. Students will also read texts not conventionally studied in the canon of Victorian literature, but which are now accepted as historically and culturally important documents of the Victorian era: Mary Seacole’s Wonderful Adventures and Toru Dutt’s writings.\nBy completing this course, students will learn the most sophisticated and innovative modes of literary interpretation, and gain a new appreciation of some of the most canonized texts in the history of English literature."
}