{
    "_id": "67346881f6c94c3b1c0cfb3d",
    "Course-ID": "noc24-mg120",
    "Discipline": "Management",
    "Course-name": "Gender Justice and Workplace Security",
    "Course-instructor": "Prof. Dipa Dube",
    "Institute-name": "IIT Kharagpur",
    "Duration": "4 Weeks",
    "Start-date": "August 19, 2024",
    "End-date": "September 13, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_mg120/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/110105080",
    "content": "The issue of gender justice has been a matter of discussion and deliberation, both at the international and national levels. With the increased participation of women in all walks of life, particularly at the workplace and the breaking of hitherto social, political and religious gender barriers, the issue has assumed significance and become subject- matter of debate at all levels including law. Today, women are donning multiple roles, apart from being a homemaker- they are working as top executives in MNCs, working as legislators in State and Central legislatures, working as educators in the education sector, etc. While the changed societal matrix & perception and economic globalization have made way for the increased participation of women, the concern over the free play of discriminatory attitudes and prejudicial mindsets often pose challenges to women and targets of multi-facet retaliations and disincentives. The incident of Nirbhaya in the Capital of the Nation not only exhibits how such treatment is basically an anathema to the concept of gender justice but also exposes the barbaric mindset annihilating the values of basic civilization. The days of yore when women were treated as fragile, feeble, dependent and subordinate to men, should be a matter of history.\nThe course is aimed at acquainting the participants with the concept of gender justice.From the arena of Constitutional guarantees to criminal law to laws ensuring safety at the workplace, specifically sexual harassment, the course will focus on understanding the laws, its procedural intricacies and judicial decisions aimed at strengthening the position of women in society."
}