{
    "_id": "67346881f6c94c3b1c0cfac3",
    "Course-ID": "noc24-hs89",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "Managing Intellectual Property in Universities",
    "Course-instructor": "Prof. Feroz Ali",
    "Institute-name": "IIT Madras",
    "Duration": "4 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "August 16, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs89/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109106148",
    "content": "Intellectual property (IP) help universities to improve their ranking, establish an innovation ecosystem, incubate knowledge-based start-ups, earn additional revenue and measure research activity. Managing intellectual property at Universities can be critical as regulatory authorities push for establishing innovation ecosystems and IP centres. The University Grants Commission (UGC) has asked all universities to set up IP centres. The National Institute Ranking Framework (NIRF) ranks institutions based on the number of patents applied for, granted and commercialised. The National Assessment and Accreditation Council (NAAC) awards points to institutes with an innovation ecosystem and a facility for identifying and promoting IP. Both the UGC and All India Council for Technical Education (AICTE) recommend changes to the curriculum with a focus on IPR education in technical institutes. Every stakeholder in an university, be it the administrators, the professors, the researchers or the students, now need to know the basics of intellectual property and learn how to identify, protect, manage and commercialise them. Those who take this course should be able to: Identify the different types of intellectual property generated by universities; Understand the need for an innovation ecosystem and the benefits it brings to universities; Know the requirements for setting up an IP centre and get practical training on how IP centres function; and Learn how startups can be incubated in universities. This course will include practical training (optional) on the setting up and running an IP centre using a free account at www.techgrapher.com"
}