{
    "_id": "67346881f6c94c3b1c0cf985",
    "Course-ID": "noc24-bt75",
    "Discipline": "Biotechnology and Bioengineering",
    "Course-name": "Introduction to Cell Biology",
    "Course-instructor": "Prof. Nagaraj Balasubramanian\nProf. Girish Ratnaparkhi",
    "Institute-name": "IISER Pune",
    "Duration": "8 Weeks",
    "Start-date": "August 19, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_bt75/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/102106096",
    "content": "This course aims to introduce students to biomolecules and important fundamental concepts in cellular biochemistry, genetics and cellular organisation. It is aimed to give you an insight into how biomolecules work and help drive cellular architecture and function in a eukaryotic cell. In the first part, we focus on the information that makes the cell tick; from its storage in DNA to its conversion to executive molecules such as RNA and protein that perform essential routine processes in the cell. The central dogma is used as a guide to explore the structure of DNA, RNA and Protein and also explore the mechanisms of DNA replication, transcription and translation. Also touched upon are other important molecules such as water, carbohydrates and lipids. In the second part,we introduce basic mechanisms of heredity, as discovered by Gregor Mendel, in a modern context. In the third part, we will be discussing cell theory and the evolution of complexity in cells and the role compartmentalisation plays in mediating the same. The organisation of cells starting from the cell membrane as we move into the cell will be discussed. We will be looking at the role cytoskeleton have in cellular organisation and function. We will also be discussing organisation, role and regulation of cell organelles, everything from the endomembrane system to lysosomes to the nucleus. Eventually, we will be briefly discussing how all these cellular components come together to drive the process of cell division."
}