{
    "_id": "67346881f6c94c3b1c0cfbec",
    "Course-ID": "noc24-ge43",
    "Discipline": "Multidisciplinary",
    "Course-name": "Current Regulatory Requirements for Conducting Clinical Trials in India for Investigational New Drugs/New Drug (Version 3.0)",
    "Course-instructor": "Prof. Arun B. Ramteke\nProf. Sucheta Banerjee Kurundkar\nProf. Nandini K Kumar\nProf. Y. K. Gupta\nProf. D. K. Sable\nProf. Rubina Bose\nProf. Vishnu Rao",
    "Institute-name": "CDSA,THSTI,DBT",
    "Duration": "8 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "September 13, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ge43/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/127106137",
    "content": "The course is developed by Clinical Development Services Agency (CDSA) in partnership with the Central Drugs Standard Control Organisation (CDSCO). The course is developed with NPTEL. CDSA is an extramural unit of the Translational Health Science & Technology Institute (THSTI). THSTI is an autonomous institution under the Department of Biotechnology (DBT), Ministry of Science & Technology, Government of India. CDSA has a national mandate to enhance the capacity and capability of clinical development in India. CDSCO is the National Regulatory Authority (NRA) of India. It is under the Directorate General of Health Services, Ministry of Health & Family Welfare, Government of India. CDSCO along with the state regulators are jointly responsible for grant of licenses of certain specialized categories of critical drugs such as blood and blood products, intravenous fluids, vaccines, and sera. It is a pre-requisite for anyone carrying out a clinical trial or involved in new drug development or research for the purpose of seeking regulatory approval in India to know about the current regulatory requirements. This is even more pertinent given the many changes and amendments in the clinical trial and new drug approval rules and regulations in India in recent years. Version 1 of this online course was launched in early 2019 with 12 lectures as a four-week course. It was attended by 1047 participants during Jan - Mar 2019. On March 19, 2019, the New Drugs and Clinical Trials (NDCT) Rules, 2019 were released. The current online course (Version 2) incorporates the changes and amendments that are part of these latest rules. A series of brainstorming sessions were conducted by CDSA with CDSCO for incorporating the new updates and the feedback received from version 1 participants. It also includes key issues that surfaced during the discussions at the six face-to-face programs (National workshop on regulatory compliance for accelerating innovations) that were conducted by CDSA (Dec 2018-July 2019) under the aegis of DBT, CDSCO, NITI Aayog, and BIRAC-NBM and inputs from the interactive session on NDCT Rules conducted by CDSA with CDSCO at THSTI (May 2019). This course (version 2) has 24 lectures spread over a period of 8 weeks. This course also involves 8 weekly assignments and a final exit assessment. Only those wishing to undertake the certification exams (which requires payment of a fee) need to opt for the latter. This online course is free. The exam is optional for a fee."
}