{
    "_id": "67346881f6c94c3b1c0cfabb",
    "Course-ID": "noc24-hs157",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "The Popular Gothic Novel",
    "Course-instructor": "Prof. Divya A",
    "Institute-name": "IIT Madras",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs157/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109106177",
    "content": "Contents of the Course ?¢‚Ç¨¬¢ The course discusses the defining traits of the popular gothic novel in the eighteenth and nineteenth-century English fiction. ?¢‚Ç¨¬¢ The course traces the structures and implications of the various plots of the popular gothic novel that caught the imagination of the reading public in the eighteenth and nineteenth-century Britain. ?¢‚Ç¨¬¢ The course introduces the students to a wide range of eighteenth and nineteenth- century novelists who were practitioners of the gothic genre such as Horace Walpole, Ann Radcliffe, Mathew Lewis, Bram Stoker, Mary Shelley, Wilkie Collins, Charles Dickens, and Charlotte Bronte Objectives of the course ?¢‚Ç¨¬¢ The course aims to introduce students of literature to the distinctive features of the gothic novel, an immensely popular literary sub-genre from the late eighteenth and nineteenth century. ?¢‚Ç¨¬¢ The course deconstructs the narrative ingredients of this subgenre such as the supernatural (assumed and real), madness, and other insidious human behaviour in the context of the social, cultural and historical upheavals that were shaking up the social order of the eighteenth and nineteenth century. ?¢‚Ç¨¬¢ The course will also encourage students to explore the different thematic configurations of the gothic such as the ?¢‚Ç¨?ìfemale gothic?¢‚Ç¨¬ù and ?¢‚Ç¨?ìthe imperial gothic?¢‚Ç¨¬ù to understand the cultural and historical anxieties reflected and refracted in such narrative consciousness. ?¢‚Ç¨¬¢ The course will also expose students to the complications in the gender dynamics embedded within the gothic narrative, and trace the literary and historical conditions that led to the construction of complex characters in this subgenre."
}