{
    "_id": "67346881f6c94c3b1c0cfb25",
    "Course-ID": "noc24-mg101",
    "Discipline": "Management",
    "Course-name": "Quantitative Investment Management",
    "Course-instructor": "Prof. J. P Singh",
    "Institute-name": "IIT Roorkee",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_mg101/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/110107162",
    "content": "Regulatory reforms across the world are gradually being introduced to reduce trade impediments between nations and usher in free market based pricing. Cross border investments through direct/portfolio routes are also being enticed as a medium for funding of growth and developmental activities. In addition, the governments of developing nations continue to pursue their strategy of partial privatization of the frontier sectors in an attempt to raise revenues for the exchequer as well as reduce operational losses with increased efficiency. Under these stimuli, scientific investment management by the investor fraternity becomes of cardinal necessity for generating competitive returns and surviving in the marketplace. Financial instruments have proven to be immensely useful as versatile investment avenues. Their vitality can be gauged from the exponential growth in trading volumes as well as the advent of new structured products literally on a day to day basis. Most courses in this area do not cover investment theory as a cogent wholesome. They deliver the content in the asymptote rather than as a mainstream course focusing either on the purely stochastic underpinnings or emphasizing the trade-based orientation. The proposed course aims to provide valuable insights into the underlying financial nuances involved in investment management holistically. The target audience is the student community who have taken some mathematics courses at the secondary level and are pursuing graduate courses in finance or management with specializations in finance and/or risk management."
}