{
    "_id": "67346881f6c94c3b1c0cfb77",
    "Course-ID": "noc24-ma75",
    "Discipline": "Mathematics",
    "Course-name": "Galois Theory",
    "Course-instructor": "Prof. Dilip Patil",
    "Institute-name": "IIT Bombay",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ma75/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/111101117",
    "content": "Galois Theory is showpiece of a mathematical unification which brings together several differentbranches of the subject and creating a powerful machine for the study problems of considerablehistorical and mathematical importance. This course is an attempt to present the theory in such alight, and in a manner suitable for undergraduate and graduate students as well as researchers.This course will begin at the beginning. The quadratic formula for solving polynomials of degree2 has been known for centuries and is still an important part of mathematics education. Thecorresponding formulas for solving polynomials of degrees 3 and 4 are less familiar. Theseexpressions are more complicated than their quadratic counterpart, but the fact that they exist comesas no surprise. It is therefore altogether unexpected that no such formulas are available for solvingpolynomials of degree > 5. A complete answer to this intriguing problem is provided by Galoistheory. In fact Galois theory was created precisely to address this and related questions aboutpolynomials. This feature might not be apparent from a survey of current textbooks on universitylevel algebra.This course develops Galois theory from historical perspective and I have taken opportunity to weavehistorical comments into lectures where appropriate. It provides a platform for the developmentof classical as well as modern core curriculum of Galois theory. Classical results by Abel, Gauss,Kronecker, Legrange, Ruffini and Galois are presented and motivation leading to a modern treatmentof Galois theory. The celebrated criterion due to Galois for the solvability of polynomials by radicals.The power of Galois theory as both a theoretical and computational tool is illustrated by a study ofthe solvability of polynomials of prime degree.The participant is expected to have a basic knowledge of linear algebra, but other that the course islargely self-contained. Most of what is needed from fields and elementary theory polynomials ispresented in the early lectures and much of the necessary group theory is also presented on the way.Classical notions, statements and their proofs are provided in modern set-up. Numerous examplesare given to illustrate abstract notions. These examples are sort of an airport beacon, shining aclear light at our destination as we navigate a course through the mathematical skies to get there.Formally we cover the following topics :Galois extensions and Fundamental theorem of Galois Theory.Finite Fields, Cyclic Groups, Roots of Unity, Cyclotomic Fields.Splitting fields, Algebraic closureNormal and Separable extensionsSolvability of equations. Inverse Galois Problem"
}