{
    "_id": "67346881f6c94c3b1c0cfbe4",
    "Course-ID": "noc24-mm45",
    "Discipline": "Metallurgical and Materials Engineering",
    "Course-name": "Mine Closure and Sustainability Planning",
    "Course-instructor": "Prof. Khanindra Pathak",
    "Institute-name": "IIT Kharagpur",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_mm45/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/113105107",
    "content": "Mine Closure Planning is now mandatory for all mining operations in India and abroad. The national policies and standards practiced for reclamation and site restoration are now streamlined for regional sustainable development. The FR and DPR of any mining project now need to take care of detailed mine closure planning. Mining ventures are now committed to minimize the long lasting impacts on landscape, ecology and on the mind set of local inhabitants. Today‚Äôs mining operations require to pay careful attention to post closure societal impacts and post mining mine-site restoration while carrying out the present production as well as environmental and maintenance oriented activities. Mine closure related activities are to be aligned & integrated with various mining activities. Closing of mining operation involves numerous issues like reclamation and environmental protection, community issues, socio-economic consideration, planning for alternate use of available facilities, cost estimation and asset disposal. Mines must have continuously reviewed and updated closure plan, aimed at rehabilitation of disturbed area, which should be acceptable to local community as well as regulatory authority. The concepts of integrated closure planning to facilitate the activities at the closing phase of a mine need now serious and scientific deliberations. Development of mine closure plans requires understanding number of interrelated concepts and aligning with societal transformations. Without adequate environmental management system, cost effective mine closure or outcome based post-closure development of mine site is impossible. Sustainable development of the mining industry requires a holistic approach from exploration of resources to their exploitation as well as eco-friendly management of the waste material. Frameworks forsustainable development of mineral sectors are to be designed keeping economy, health and safety, ecology and global laws in perspective. This course is designed to address these issues through a comprehensive academic approach for real life applications and development of transitional activities in the mining industry."
}