{
    "_id": "67346881f6c94c3b1c0cfbe7",
    "Course-ID": "noc24-ge38",
    "Discipline": "Multidisciplinary",
    "Course-name": "Teaching And Learning in General Programs: TALG",
    "Course-instructor": "Prof. N J Rao",
    "Institute-name": "IISc Bangalore",
    "Duration": "4 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "August 16, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ge38/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/127108015",
    "content": "The quality of Teaching And Learning in General Programs (Humanities, Social Sciences and Sciences) (TALG) has come to be an important issue in India to all stakeholders including teachers, students, parents, Managements, Universities, UGC, AICTE, NAAC and Employers. Undergraduate programs of three or four year duration are offered in Humanities, Social Sciences and Sciences. 40,000 Degree Colleges provide most of the graduate level workforce to Government and Private Organizations in India. The quality of learning of their graduates will make a major difference to the wealth generating and service providing abilities of these organizations. Courses in Humanities, Social Sciences and Sciences (nearly 30 credits out of 160 credits) are also offered in all undergraduate engineering programs in more than 4000 higher education institutions. The quality of learning of the graduates of these programs determines the quality of their placements. While there has been significant increase in the last few decades in our understanding of how people learn, there has not been much intersection of this knowledge with the instructional practices at institutions of higher learning. The dominant instructional method still remains lecturing/one-way information transfer. Employers, Regulatory Bodies and Accreditation Agencies in India want the graduates attain a set of Program Outcomes (knowledge, skills and attitudes) to be identified by the Institutions offering the General Programs. These Program Outcomes need to be discipline agnostic. The curriculum of a program decides the nature of learning experiences including the courses, projects, field work, internships, and co-curricular and extra-curricular activities."
}