{
    "_id": "67346881f6c94c3b1c0cf952",
    "Course-ID": "noc24-ag09",
    "Discipline": "Agriculture Engineering",
    "Course-name": "Food Oils and Fats : Chemistry and Technology",
    "Course-instructor": "Prof. Hari. Niwas Mishra",
    "Institute-name": "IIT Kharagpur",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ag09/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/126105027",
    "content": "Food oils and fats are the important sources of dietary fats that fulfil nutritional requirements, support growth, and are vital for the healthy operation of the brain, nervous system, and endocrine environment. These can be extracted from plant, animal and marine sources using appropriate and right technology with high nutritional composition. Varieties of oils are available in the market; their utility depend upon their quality which helps in proper development of body and reduces the risk of diseases. Food oils and fats processing is having an important position in the Indian economy as India is a major consumer of edible oils and fats. Moreover, the consumption of food oils and fats varies from place to region based on consumer preferences and diversity. To achieve the desired characteristics in edible oils and fats, the knowledge of the type and quality of raw material, processing technologies, packaging techniques and storage conditions, etc. is of utmost necessity and importance. Also, to earn additional income, the utilization of the by-product of the edible oil and fat industry for novel product development is necessary. This course ?¢‚Ç¨?ìFood Oils and Fats: Chemistry and Technology?¢‚Ç¨¬ù will provide detailed information on the basic chemistry of fatty acids (SFA/MUFA/PUFA/Cis-Trans, etc.); triglycerides and phospholipids, sources of oils and fats, processing technologies, handling, packaging and storage, and by-product utilization. This course will play a pivotal role in creating a human resource with an enhanced knowledge base for serving the food industry and academia including research & development. The course will provide ample materials for the preparation of competitive examinations like GATE / NET / ARS, etc. This will enable new idea generation & innovation for the commercial manufacture of products which ultimately lead our country to an international platform"
}