{
    "_id": "67346881f6c94c3b1c0cf955",
    "Course-ID": "noc24-ag11",
    "Discipline": "Agriculture Engineering",
    "Course-name": "Post Harvest Operations and Processing of Fruits, Vegetables, Spices and Plantation Crop Products",
    "Course-instructor": "Prof. H N Mishra",
    "Institute-name": "IIT Kharagpur",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_ag11/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/126105023",
    "content": "According to the Food and Agriculture Organization (FAO), about 1.3 billion tons of food (30-50% of the total production) are globally wasted or lost per year. In India, post-harvest losses of fruits and vegetables are around 15% and the processing and value addition is less than 10% (CIPHET Annual Report 2018-19). The huge gap between production and utilization can be mitigated by post-harvest management and value addition which include the creation of innovative technologies for processing, preservation and storage practices. The byproducts and waste could also be converted into value-added novel/innovative products and ingredients which would be functionally more beneficial that can further enhance global food security and sustainability. An intense demand persists for food products that not only provide health & nutrition benefits and convenience to the consumers but also offer immense economic promise to the food processing industry and the farmers. This course ?¢‚Ç¨?ìPost-Harvest Operations and Processing of Fruits, Vegetables, Spices and Plantation Crop Products?¢‚Ç¨¬ù deals with the principles & practices and technological innovations in post-harvest handling, processing, packaging & storage of fruits, vegetables, spices, plantation crops, and utilization of these materials into the preparation of healthy & nutritious food products. This course will play a pivotal role in creating a human resource with an enhanced knowledge base for serving the food industry and academia including research & development. The course will provide ample materials for the preparation of competitive examinations like GATE / NET / ARS, etc. This will enable new idea generation & innovation for the commercial manufacture of products which ultimately lead our country to an international platform."
}