{
    "_id": "67346881f6c94c3b1c0cfb2d",
    "Course-ID": "noc24-mg104",
    "Discipline": "Management",
    "Course-name": "Labour Welfare and Industrial Relations",
    "Course-instructor": "Prof. Abraham Cyril Issac",
    "Institute-name": "IIT Guwahati",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_mg104/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/110103506",
    "content": "Industrial Relations and Labour Legislation is a subject broadly concerned with nuances of employment. This is a multidisciplinary field of study which examines the interrelations of varying complexities between employers and employees, employer organisations and the state with trade and labour unions. Industry is one of the major contributors to the growth of Indian economy. As such it is pivotal to ensure the smooth functioning of the interrelationship between the stakeholders, namely, employers and employees. This makes it imperative to be well averse with the labour legislations of the country, in order to promote the worker’s welfare, along with achieving the nation’s economic prosperity. With the help of Industrial Relations laws, living standards can be improved, and increased globalization could be achieved through flexibility in the labour market. Similarly, labour legislation laws mediate work relationships and focus on the right of the employees at the place of work. It prevents exploitation of workers, at the hands of the employers.\n\nThis course will provide a detailed understanding of the labour-industry interface and will serve as a source of practical knowledge to learners. The course will also introduce learners to the Labour Codes developed in 2019-20 which consolidates the central labour laws into broader groups of Labour Codes.\n\nLearning outcomes:\nOn completion of the course, learners will be\nExposed to various IR situations and will learn extant laws that apply to a given set of contexts within the ecosystem of work.\nFamiliarized with the administration of labour laws in India at the National and State levels\nEnhancing their understanding on functioning of labour related departments"
}