{
    "_id": "67346881f6c94c3b1c0cfac5",
    "Course-ID": "noc24-hs134",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "Literary and Cultural Disability Studies: An Exploration",
    "Course-instructor": "Prof. Hemachandran Karah",
    "Institute-name": "IIT Madras",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs134/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109106185",
    "content": "Like other human conditions, disability offers a unique vantage position in the understanding of cultural expressions such as literature, folklore, and film. Such a vantage position derives from disabilitys capacity to offer novel frameworks for interpreting academic institutions such as literary criticism. Why that should be the case? Human capacities, abilities, vulnerabilities, and a spectrum of sentiments determine how long, and in what direction an idea travels. Likewise, conditions such as madness may instill newer narrative dispersions that one can ill afford to ignore. Literary and Cultural Disability Studies (LCDS) is the most appropriate forum for examining such narrative maneuverings. That said, LCDS is much more than that. For example, as a lens for exploring literary and cultural arrangements, LCDS may aid us in addressing the following questions differently: 1 The canon question. 2 The art of interpretation involving text and contexts. 3 The multilingual question. To comprehend the enduring connect between disability politics and the multilingual question, we have an elaborate workshop on Indian Sign Language (ISL). And 4 Interdisciplinarity and the problem of accommodation. An engagement with these questions renders LCDS as a sequel to my introductory course on Disability Studies. Students pursuing masters in literature, culture, and social sciences broadly may appreciate the diversity of content in this course. For those who are pursuing doctoral and postdoctoral research, this course may come handy too. It hosts lectures and conversations on methods, frameworks, and approaches concerning culture, language, and politics. In sum, students from humanities and social sciences may relish myriad cultural debates surrounding disability, as much as its treatment as an interpretative method."
}