{
    "_id": "67346881f6c94c3b1c0cfafb",
    "Course-ID": "noc24-hs168",
    "Discipline": "Humanities and Social Sciences",
    "Course-name": "Threads of Visual Exploration: Textiles and Allied Practices - Part II",
    "Course-instructor": "Prof. Rajarshi Sengupta",
    "Institute-name": "IIT Kanpur",
    "Duration": "4 Weeks",
    "Start-date": "August 19, 2024",
    "End-date": "September 13, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_hs168/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/109104497",
    "content": "This course puts forward an invested and interdisciplinary way of examining, analysing and appreciating Indian textiles drawing on the ongoing scholarly discussions around craft-art interface, visual and contextual analysis of art practices and sustainability. The course puts forward demonstrations of hands-on practices and interviews on sustainable textile practices which complements the in-depth discussions on the history of textiles and crafts in India. The insights gleaned from the discussions and demonstrations will be beneficial for art practitioners, designers, aspiring art historians, and those preparing for competitive examinations.\nStudies in Indian textiles have underscored a range of pertinent topics, including textiles and trade networks (Barnes 1997, 2017; Crill 2006, 2008; Peck 2013), materials and techniques of textile making (Bea 1989; Cecil 2013; Cohen 2016), textiles and identity formation (Edwards 2011, 2016) and innovation and sustainability (Sethi 2016; Venkatesan 2010). Alongside, fresh perspectives into textile makers’ intelligence (Fee 2020; Sengupta 2021) and sensory perception of historical textiles and other artifacts (Houghteling 2022) situated Indian textiles in the intersection of art history,material culture, design history and practice-based studies. Drawing on these ongoing discussions, the course aims to broaden the scope to consider the concepts and tangible presence of textiles and allied practices and their deep impact on societies. Furthermore, the hands-on aspects of textile making and interviews contribute to a more comprehensive understanding and appreciation of textiles and allied practices of India."
}