{
    "_id": "67346881f6c94c3b1c0cfbb4",
    "Course-ID": "noc24-me135",
    "Discipline": "Mechanical Engineering",
    "Course-name": "Advanced Thermodynamics and Combustion",
    "Course-instructor": "Prof. Niranjan Sahoo",
    "Institute-name": "IIT Guwahati",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_me135/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/112103313",
    "content": "?¢‚Ç¨?ìAdvanced Thermodynamics?¢‚Ç¨¬ù is one of the core courses in the curriculum of postgraduate (PG) syllabus in the Mechanical Engineering Discipline. Also, the fundamental course on ?¢‚Ç¨?ìCombustion?¢‚Ç¨¬ù is also offered as an electives for PG audience and research scholars of Mechanical, Aerospace and Energy Engineering disciplines. Classically, both courses are popular in most of the engineering colleges in the country. In these courses, the basic thermodynamic fundamentals are studied in details and the thermochemistry concepts are applied to combustion phenomena occurring in internal combustion (IC) engines, gas turbine (GT) engines, rocket propulsion etc. In this backdrop, a blended version of the course has been designed for the next generation learners. It is offered in the name of ?¢‚Ç¨?ìAdvanced Thermodynamics and Combustion?¢‚Ç¨¬ù that highlights the thermodynamic concepts/equations in various combustion process. The course package is mainly composed of the following major contents: (a) Exhaustive discussions on entropy and exergy analysis in thermodynamic systems; (b) Thermodynamic property relations and its application to gas mixtures, phase change processes; (c) Combustion fundamentals involving premixed and non-premixed flames for laminar and turbulent combustion; (d) Combustion phenomena in practical occurring applications such IC and GT engines."
}