{
    "_id": "67346881f6c94c3b1c0cf993",
    "Course-ID": "noc24-bt59",
    "Discipline": "Biotechnology and Bioengineering",
    "Course-name": "Wild Life Ecology",
    "Course-instructor": "Prof. Ankur Awadhiya",
    "Institute-name": "IIT Kanpur",
    "Duration": "12 Weeks",
    "Start-date": "July 22, 2024",
    "End-date": "October 11, 2024",
    "Course-link": "https://onlinecourses.nptel.ac.in/noc24_bt59/preview",
    "NPTEL-URL": "https://nptel.ac.in/courses/102104073",
    "content": "The times are changing: we live in an era when issues such as climate change, over population, pollution, habitat loss and mass extinction of species are no longer just academic concepts; we are witnessing them in our daily lives and suffering their consequences. We are continuously trashing our planet and harming ourselves in the process. And this is when we know so much about what the issues are, how and why they arise, and how they can be solved. We have the technological solutions; and still we?re largely unable to actually solve the problems. This is largely because these problems require not just a technological solution ? they also require reworking of national and global policies. And solving the problems will entail costs and require money ? such as for treating waste water before disposal, for increasing the efficiency of resource utilisation to reduce overconsumption of resources, for shifting to greener sources of energy that don?t emit greenhouse gases, for shifting to green chemistry that doesn?t pollute, for making infrastructures that do not harm the wildlife, and for incentivising more research to make better technologies. It is these costs, and not just a lack of technology, that prevent us from solving the problems. Thus, the need of the hour is to understand the Economics of Conservation to create an environment where we can use technologies to solve our problems. In this course, we shall look at the processes of Conventional Economics that have led to the destruction of the environment by putting profits above everything, and how we can solve these issues of Conventional Economics with a better understanding of Economics ? Green Economics."
}